//IBMUSERX  JOB NOTIFY=&SYSUID
//STEP1     EXEC PGM=ACCTPGM1
//STEPLIB   DD DSN=IBMUSER.T5.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//ACCTDD01  DD DSN=IBMUSER.T5.ACCT.FILE,DISP=(NEW,CATLG,DELETE),
//             UNIT=3390,VOL=SER=JASYS1,
//             SPACE=(TRK,(1,1),RLSE),
//             DSORG=PS,LRECL=30,RECFM=FB,BLKSIZE=0
//SYSIN     DD *
S1111
ANIL KUMAR
10000
SAVINGS
Y
S1111
ANIL KUMAR
10000
SAVINGS
Y
C1111
ANIL KUMAR
10000
CURRENT
Y
C1111
ANIL KUMAR
10000
CURRENT
N
/*
