//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=USER.SOURCE.LOADLIB,DISP=SHR
//SYSUT2   DD DSN=USER.BACKUP.LOADLIB,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=3390,
//            SPACE=(TRK,(5,2),RLSE)
//SYSIN    DD *
  COPY INDD=SYSUT1,OUTDD=SYSUT2
/*
//
