//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=USER.SOURCE.DATA,DISP=SHR
//SYSUT2   DD DSN=USER.BACKUP.DATA,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=3390,
//            SPACE=(TRK,(5,2),RLSE)
//SYSIN    DD DUMMY
