//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=USER.INPUT.DATA,DISP=SHR
//SORTOUT  DD DSN=USER.SORTED.DATA,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=3390,
//            SPACE=(TRK,(5,2),RLSE)
//SYSIN    DD *
  SORT FIELDS=(1,10,CH,A)
/*
