//IBMUSERX  JOB NOTIFY=&SYSUID
//STEP1     EXEC PGM=ACCTPGM2
//STEPLIB   DD DSN=IBMUSER.T5.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//ACCTDDIN  DD DSN=IBMUSER.T5.ACCT.FILE,DISP=SHR
//SAVEDDOT  DD DSN=IBMUSER.T5.SAVE.FILE,DISP=(NEW,CATLG,DELETE),
//             UNIT=3390,VOL=SER=JASYS1,
//             SPACE=(TRK,(2,2),RLSE),
//             DSORG=PS,LRECL=30,RECFM=FB,BLKSIZE=0
//CURRDDOT  DD DSN=IBMUSER.T5.CURR.FILE,DISP=(NEW,CATLG,DELETE),
//             UNIT=3390,VOL=SER=JASYS1,
//             SPACE=(TRK,(2,2),RLSE),
//             DSORG=PS,LRECL=30,RECFM=FB,BLKSIZE=0
//
