//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEBCOMPR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=USER.INPUT.DATA1,DISP=SHR
//SYSUT2   DD DSN=USER.INPUT.DATA2,DISP=SHR
//SYSIN    DD DUMMY
//
