//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=MAINPGM1
//STEPLIB  DD DSN=IBMUSER.T5.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
BINDU
/*
//
