       01 BILL-LAYOUT.
           03 CARD-NUMBER       PIC X(05).
           03 CUST-NAME         PIC X(20).
           03 TOT-DUE-2-PAY     PIC S9(05)V9(02).
           03 MIN-DUE-2-PAY     PIC S9(05)V9(02).
           03 BILLING-DATE      PIC X(08).
           03 DUE-DATE          PIC X(08).
