//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=MATCHLP1
//STEPLIB  DD DSN=IBMUSER.T5.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//TRANSDD1 DD DSN=IBMUSER.T5.CC.TRANS,DISP=SHR
//MASTDD01 DD DSN=IBMUSER.T5.CC.MAST,DISP=SHR
//BILLDD01 DD DSN=IBMUSER.T5.CC.BILLRPT,DISP=(NEW,CATLG,DELETE),
//             UNIT=3390,VOL=SER=JASYS1,
//             SPACE=(TRK,(1,1),RLSE),
//             DCB=(DSORG=PS,LRECL=45,RECFM=FB,BLKSIZE=0)
//
