//IBMUSERX  JOB NOTIFY=&SYSUID
//STEP1     EXEC PGM=ADDPGM01
//STEPLIB   DD DSN=IBMUSER.T0.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSIN     DD *
10
50
/*
//
