//IBMUSERX JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=CARDPGM1
//STEPLIB  DD DSN=IBMUSER.T5.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
C1111
ANIL
10000
04000
Y
C1111
ARUN
10000
05000
Y
C3333

10000
02000
N
/*
